IDEA Open Model
SectionCharacteristics Properties
Compatible with IDEA StatiCa Beta 20.0
The SectionCharacteristics type exposes the following members.
Properties
Name | Description
A
 Gets or sets the area.
Ay
 Shear area
Az
 Shear area
Cgy
 Gets the centre of gravity related to the axis Y.
Cgz
 Gets the centre of gravity related to the axis Z.
Dyz
 Gets or sets the product moment of area.
E
 Gets or sets the responding E modulus.
It
 Gets or sets the Torsional constant.
Iw
 Gets or sets the Warping constant.
Iy
 Gets or sets the second moment of area related to the Y axis.
Iz
 Gets or sets the second moment of area related to the Z axis.
Rgy
 Gets the radius of gyration related to the axis Y. Also known as iy.
Rgz
 Gets the radius of gyration related to the axis Z. Also known as iz.
Sy
 Gets or sets the first moment of area related to the Y axis.
Sz
 Gets or sets the first moment of area related to the Z axis.
Wely
 Gets or sets the Elastic section modulus related to axis Y.
Welz
 Gets or sets the Elastic section modulus related to axis Z.
Wply
 Gets or sets the Plastic section modulus related to axis Y.
Wplz
 Gets or sets the Plastic section modulus related to axis Z.
Y0
 Gets or sets the Shear center coordinate Y related to the center of gravity.
Z0
 Gets or sets the Shear center coordinate Z related to the center of gravity.
Top
See Also
Reference
SectionCharacteristics Class
IdeaRS.OpenModel.Geometry2D Namespace